from time import sleep as timeout
import time
import base64
import socket
import sys
import os
os.system ('clear')
os.system ('clear')
print ('\033[1;32m')
print ("██╗░░██╗░█████╗░░█████╗░██╗░░██╗░░░░░███████╗██████╗░")
print ("██║░░██║██╔══██╗██╔══██╗██║░██╔╝░░░░░██╔════╝██╔══██╗ ")
print ("███████║███████║██║░░╚═╝█████═╝░░░░░░█████╗░░██████╦╝")
print ("██╔══██║██╔══██║██║░░██╗██╔═██╗░░░░░░██╔══╝░░██╔══██╗")
print ("██║░░██║██║░░██║╚█████╔╝██║░╚██╗░░░░░██║░░░░░██████╦╝")
print ("╚═╝░░╚═╝╚═╝░░╚═╝░╚════╝░╚═╝░░╚═╝░░░░░╚═╝░░░░░╚═════╝░")
print ('  \033[1;31m كﻮﺒﺴﻴﻓ  يﻓ ﺔقدﺎﺼﻤﻟا زوﺎﭴﺗ  ڪﻧڪﻤﯾ تﯾﺑرڪﺴ ادھ')
print ('  \033[1;31m تﯾﺑرڪﺴ ﻟﻴﻏﺴًًَﺗ  ﻟﺑﻗ  ﻟوﺧد ﻟﭴﺴﺗ ڪﯾﻟﻋ')
print ('')
print ("\033[1;36m                         1 ﺔﻗﯾرط")

print (" \033[1;33m    1 -  زﺎھﭴﻟ ادھ يﻓ دﭴوﻤﻟ فﺗﺎھ مﻗرﺑ  ﻟﭴﺴ")
print (" \033[1;33m    2 -  ﮑفﺗﺎھ مﻗر ىﻟإ هﺎﻧﻟﺴرأ يدﻟ زﻤر  ﻟلﺧدأ")
print (" \033[1;33m    3 -   ﺔﯾﺤﺿ بﺎﺴﺤ طﺑار بﺗڪأ مﺗ")

print ("\033[1;36m                          2 ﺔﻗﯾرط")

print (" \033[1;33m    1 -  ﻟﻤﮑﺗﻟ بﺎﺴﺗو توﺑ ىﻟإ ڪفﺗﺎھ مﻗر ﻟﺴرأ")
print (" \033[1;33m    2 -  ﮑفﺗﺎھ مﻗر ىﻟإ هﺎﻧﻟﺴرأ يدﻟ زﻤر بﺎﺴﺗو يﻓ توﺑﻟ ﻟﺴرأ")
print (" \033[1;33m    4 - ﺔﯾﺤﺿ بﺎﺴﺤ طﺑار بﺗڪأ مﺗ")
print ("")
print ("")
print ("")
fx9 = input ("  \033[1;36m  ﺔﻗﯾرط  مﻗر بﺗڪأ  ==> \033[1;32m")
if fx9 == '2' :
            os.system ('python facebook.py')
            restart ()
elif fx9 == 'Yasser YL' :
            os.system ('python rot.py')
main (main)
home_main ()
